Revit 2026 API

# IndependentTagTagHeadPosition Property

---

The position of the head of tag in model coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ TagHeadPosition { get; set; }
```
```vb
Public Property TagHeadPosition As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ TagHeadPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member TagHeadPosition : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The depth of the tag head position in the view does not matter because tags are drawn over model geometry in the view.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace